html/git-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-16 Thu 22:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Git Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ea6ffc">1. Git Cheat Sheet</a>
<ul>
<li><a href="#org3f8360c">1.1. Basics</a>
<ul>
<li><a href="#orgb193de8">1.1.1. Basic Commands</a></li>
</ul>
</li>
<li><a href="#orga7b6375">1.2. Aliases for Commands</a></li>
<li><a href="#org951c770">1.3. Mistake on commit message</a></li>
<li><a href="#org96e37f0">1.4. List repository's history of commits</a></li>
<li><a href="#orgf95608f">1.5. Update the last commit with new files (if not pushed yet!)</a></li>
<li><a href="#org75e2b9a">1.6. Revert Last (garbage) Commit</a></li>
<li><a href="#orgfb734da">1.7. Rename the 'master' branch (main, mega, mucho)</a></li>
<li><a href="#org8a7f406">1.8. Return to a working state of the past (past commit)</a></li>
<li><a href="#org07579b1">1.9. Squash commits</a></li>
<li><a href="#org0213648">1.10. Git Hooks (~run code before the commit the committed)</a></li>
<li><a href="#orgf175e73">1.11. Revert bad local changes back to master (last committed state)</a></li>
<li><a href="#org4c6ce74">1.12. Switch back to the previous working branch</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1ea6ffc" class="outline-2">
<h2 id="org1ea6ffc"><span class="section-number-2">1</span> Git Cheat Sheet</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3f8360c" class="outline-3">
<h3 id="org3f8360c"><span class="section-number-3">1.1</span> Basics</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><p>
Add all files in directory:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git add .
</pre>
</div></li>

<li><p>
Commit with message:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git commit -m "first commit"
</pre>
</div></li>

<li>Do both at once with the -am flag* Git Cheat Sheet</li>
</ul>
</div>

<div id="outline-container-orgb193de8" class="outline-4">
<h4 id="orgb193de8"><span class="section-number-4">1.1.1</span> Basic Commands</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">$ git init</td>
<td class="org-left">Initialize local git repository</td>
</tr>

<tr>
<td class="org-left">$ git add &lt;file&gt;</td>
<td class="org-left">Add File(s) to index ('.' for all files in dir)</td>
</tr>

<tr>
<td class="org-left">$ git status</td>
<td class="org-left">Check the status of the working tree</td>
</tr>

<tr>
<td class="org-left">$ git commit</td>
<td class="org-left">Commit changes to index</td>
</tr>

<tr>
<td class="org-left">$ git push</td>
<td class="org-left">Push to remote repository</td>
</tr>

<tr>
<td class="org-left">$ git pull</td>
<td class="org-left">Pull latest from remote repository</td>
</tr>

<tr>
<td class="org-left">$ git clone</td>
<td class="org-left">Clone repository into a new directory</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orga7b6375" class="outline-3">
<h3 id="orga7b6375"><span class="section-number-3">1.2</span> Aliases for Commands</h3>
<div class="outline-text-3" id="text-1-2">
<p>
For example create an alias for "commit -am" to use with just 2 letters (ac):
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git config --global alias.ac "commit -am"
</pre>
</div>
</div>
</div>

<div id="outline-container-org951c770" class="outline-3">
<h3 id="org951c770"><span class="section-number-3">1.3</span> Mistake on commit message</h3>
<div class="outline-text-3" id="text-1-3">
<p>
If you made a mistake on the last commit message, you can use
the '- -amend' flag to change the last commit message:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git commit --amend -m "new commit message"
</pre>
</div>
</div>
</div>

<div id="outline-container-org96e37f0" class="outline-3">
<h3 id="org96e37f0"><span class="section-number-3">1.4</span> List repository's history of commits</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-sh">$ git log

$ git log --oneline

$ git log --graph --oneline --decorate
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf95608f" class="outline-3">
<h3 id="orgf95608f"><span class="section-number-3">1.5</span> Update the last commit with new files (if not pushed yet!)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Use the '- -no-edit' flag to keep the existed commit message
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git add .

$ git commit --amend --no-edit
</pre>
</div>

<p>
If you want to live dangerously, you can overwrite the last pushed commit:
But if there are any commits you don't have, it'll be forever lost.
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git push origin master --force
</pre>
</div>
</div>
</div>

<div id="outline-container-org75e2b9a" class="outline-3">
<h3 id="org75e2b9a"><span class="section-number-3">1.6</span> Revert Last (garbage) Commit</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Ctrl-Z in steroids.
</p>
<div class="org-src-container">
<pre class="src src-sh">$ git revert commitName
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb734da" class="outline-3">
<h3 id="orgfb734da"><span class="section-number-3">1.7</span> Rename the 'master' branch (main, mega, mucho)</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-sh">$ git branch -M main
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a7f406" class="outline-3">
<h3 id="org8a7f406"><span class="section-number-3">1.8</span> Return to a working state of the past (past commit)</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-sh">$ git bisect start

$ git bisect bad

$ git bisect good
</pre>
</div>

<p>
See the documentation: <a href="https://git-scm.com/docs/git-bisect">Git Bisect</a>.
</p>
</div>
</div>

<div id="outline-container-org07579b1" class="outline-3">
<h3 id="org07579b1"><span class="section-number-3">1.9</span> Squash commits</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Merge multiple commits (as one merged commit) from another branch (a features branch
for example) to the <del>master</del> main branch.
</p>

<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git rebase main --interactive
</pre>
</div>

<p>
In the file created,
</p>
<ul class="org-ul">
<li>to use a commit, use the <i>pick</i> command,</li>
<li>change a message, using the <i>reword</i> command, or</li>
<li>combine (squash) everything, into the original commit,
using the <i>squash</i> command.</li>
</ul>

<p>
Save and close the file.
Git will pull another file prompting you to update the commit message,
which by default will be a combination of all messages you have just squashed.
</p>

<p>
If you don't want all the messages to be combined you can use '- -fixup' instead
of '- -squash' when you're doing the rebase.
</p>

<p>
To be even more productive you can use the '- -fixup' and '- -squash' flags on
the commits you are making on your branch, so that it tells git in advance that you
want to squash them, so when you go to do a rebase ($ git rebase -i - -autosquash)
with the auto squash flag it can handle all the squashing automatically.
</p>

<p>
Read the documentation for more: <a href="https://git-scm.com/docs/git-rebase">Git Rebase</a>.
</p>
</div>
</div>

<div id="outline-container-org0213648" class="outline-3">
<h3 id="org0213648"><span class="section-number-3">1.10</span> Git Hooks (~run code before the commit the committed)</h3>
<div class="outline-text-3" id="text-1-10">
<p>
For repository maintaining, docs: <a href="https://git-scm.com/book/en/v2/Customizing-Git-Git-Hooks">Git Hooks</a>.
</p>
</div>
</div>

<div id="outline-container-orgf175e73" class="outline-3">
<h3 id="orgf175e73"><span class="section-number-3">1.11</span> Revert bad local changes back to master (last committed state)</h3>
<div class="outline-text-3" id="text-1-11">
<p>
You made changes on the local repo and you screw up as always.
To revert the changes back to the origin/master run the following:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git fetch origin
</pre>
</div>


<p>
and,
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git reset --hard origin/master
</pre>
</div>

<p>
to overwrite the local code with the remote.
</p>

<p>
If there are any crappy files left after that, use the following
command to clean the up:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git clean -df
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c6ce74" class="outline-3">
<h3 id="org4c6ce74"><span class="section-number-3">1.12</span> Switch back to the previous working branch</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-sh">$ git checkout -
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2021-09-16 Thu 22:51</p>
</div>
</body>
</html>
